{
  "title": "Real-World Brand Examples",
  "sections": [
    {
      "type": "heading",
      "content": "Additional Brand Examples"
    },
    {
      "type": "paragraph",
      "content": "Let's explore how different brands approach social media marketing and customer engagement."
    },
    {
      "type": "heading",
      "content": "Nike"
    },
    {
      "type": "paragraph",
      "content": "Nike routinely answers questions on social media, from order issues to product info. They treat social media as a **hybrid of customer support and brand engagement**."
    },
    {
      "type": "paragraph",
      "content": "This approach shows that social media isn't just about marketing—it's also a crucial customer service channel where quick, public responses can build trust and loyalty."
    },
    {
      "type": "heading",
      "content": "Dbrand"
    },
    {
      "type": "paragraph",
      "content": "Dbrand is a company that advertises almost entirely through social media. While different from traditional social media posting, they also regularly do brand deals with YouTube channels."
    },
    {
      "type": "paragraph",
      "content": "Their social media posts uphold their **flippant, self-deprecating humor** that's iconic for their brand. This consistent tone has become a key part of their identity and marketing strategy."
    },
    {
      "type": "heading",
      "content": "Duolingo"
    },
    {
      "type": "paragraph",
      "content": "Then, there's whatever Duolingo is doing on TikTok."
    },
    {
      "type": "paragraph",
      "content": "While social media content can be sterilized and focused on remaining professional, Duolingo has fully embraced TikTok as a platform, often poking fun at themselves and their incessant push notifications, or their \"lazy\" audience that refuses to finish their daily Spanish lessons."
    },
    {
      "type": "paragraph",
      "content": "Duolingo uses TikTok and X (Twitter) as well as other platforms to stay engaged with its audience."
    },
    {
      "type": "heading",
      "content": "The \"Death of Duo\" Campaign"
    },
    {
      "type": "paragraph",
      "content": "This year, Duolingo had its most successful marketing moment yet with the **\"Death of Duo\"** campaign. What did that stunt teach about how to drive and sustain audience engagement?"
    },
    {
      "type": "quote",
      "content": "One of our team mantras is that the comments section is our brief. We pay close attention to what people say, and we aren't afraid to experiment in response. Duo works because he's not just a mascot, he's an internet personality that people feel connected to. This campaign reminded us that sustained engagement comes from building a character people care about, then giving them a story they want to be part of. It also showed us how powerful these moments can be, and we're excited to create more of them in the future."
    },
    {
      "type": "heading",
      "content": "Post-Discussion Questions"
    },
    {
      "type": "list",
      "ordered": false,
      "items": [
        "Can you think of other brands that have a unique social presence?",
        "Can you think of a brand that isn't necessarily unique in their interactions, but effectively makes use of social media as a marketing or interaction tool?"
      ]
    }
  ]
}
