{
  "title": "Introduction to Social Media Marketing",
  "sections": [
    {
      "type": "heading",
      "content": "Pre-Discussion Questions"
    },
    {
      "type": "paragraph",
      "content": "Before we dive in, consider these questions:"
    },
    {
      "type": "list",
      "ordered": false,
      "items": [
        "Do you ever see marketing from brands on Social Media? Give examples.",
        "What's an example of a company that primarily markets through social media?",
        "What social media outlets are used? (TikTok, X, Facebook, YouTube, Instagram, etc.)"
      ]
    },
    {
      "type": "heading",
      "content": "Why Social Media Matters"
    },
    {
      "type": "paragraph",
      "content": "Social media doesn't have to just be another place to post ads. It's a space where brands can **stay relevant**, **interact with their audience**, and **shape public perception in real time**."
    },
    {
      "type": "paragraph",
      "content": "People have come to expect brands to have a personality online—not necessarily funny or bold, but **human enough** to feel like someone is behind the account instead of the traditional, sterilized or faceless content everyone is used to."
    },
    {
      "type": "video",
      "url": "https://www.youtube.com/embed/RmwI_QqcPQc?si=KtvgElwxJYmW1NY4",
      "title": "Social Media Marketing Overview"
    },
    {
      "type": "heading",
      "content": "The Shift in Brand Communication"
    },
    {
      "type": "paragraph",
      "content": "A great example of this shift happened back in 2017 with Wendy's, which we'll explore in detail in the next module."
    },
    {
      "type": "paragraph",
      "content": "The key takeaway: Social media is a powerful tool that allows you to remain relevant online and constantly engage with your customer base. How you choose to do that is up to you (and your PR department), but most angles can be successful if you're publicly accessible to your audience."
    },
    {
      "type": "heading",
      "content": "What a Strong Social Presence Means"
    },
    {
      "type": "list",
      "ordered": false,
      "items": [
        "It's not just a billboard, but rather, a **two-way engagement platform**",
        "\"Corporate voice\" is no longer the only option",
        "Being accessible can increase positive sentiment",
        "Different platforms reach different demographics",
        "People treat brand accounts like people they can talk to"
      ]
    },
    {
      "type": "paragraph",
      "content": "**Most importantly:** Social media is where customers already are. Brands that show up consistently stick in people's minds."
    }
  ]
}
