{
  "title": "Case Study: The Wendy's Revolution",
  "sections": [
    {
      "type": "heading",
      "content": "The Wendy's Example"
    },
    {
      "type": "paragraph",
      "content": "Wendy's changed the social media game when they began treating their Twitter/X account like it was a real person posting instead of a PR department. They joked around, roasted competitors, responded to followers, and leaned fully into a tone that was really uncommon in traditional advertising."
    },
    {
      "type": "paragraph",
      "content": "Poking fun at competitors wasn't necessarily a new idea, but their method was an unusual approach in the medium of social media."
    },
    {
      "type": "image",
      "src": "content/Marketing/SMM/images/wendyroast.png",
      "alt": "Example of Wendy's witty social media roast",
      "caption": "Wendy's signature roasting style on social media"
    },
    {
      "type": "heading",
      "content": "Why Did It Work?"
    },
    {
      "type": "list",
      "ordered": false,
      "items": [
        "It felt **human**, not corporate",
        "It was **consistent**",
        "It aligned with internal brand changes (improving wages, being more transparent about pricing)",
        "It kept Wendy's constantly in the public conversation"
      ]
    },
    {
      "type": "paragraph",
      "content": "Their social voice amplified their brand and brought attention to real business changes happening behind the scenes."
    },
    {
      "type": "heading",
      "content": "The Lesson Behind This Example"
    },
    {
      "type": "paragraph",
      "content": "Social media is a powerful tool that allows you to remain relevant online and constantly engage with your customer base. How you choose to do that is up to you (and your PR department), but most angles can be successful if you're publicly accessible to your audience."
    },
    {
      "type": "heading",
      "content": "Key Takeaways"
    },
    {
      "type": "list",
      "ordered": false,
      "items": [
        "Social media is a **two-way engagement platform**, not just a billboard",
        "\"Corporate voice\" is no longer the only option",
        "Being accessible can increase positive sentiment",
        "Different platforms reach different demographics",
        "People treat brand accounts like people they can talk to",
        "Social media is where customers already are—brands that show up consistently stick in people's minds"
      ]
    }
  ]
}
